In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Company': ['Google', 'Google', 'Microsoft', 'Microsoft', 'Facebook', 'Facebook'],
    'Employee': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'Sales': [200, 120, 340, 124, 243, 350]
}

{'Company': ['Google',
  'Google',
  'Microsoft',
  'Microsoft',
  'Facebook',
  'Facebook'],
 'Employee': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

### q1 데이터프레임을 생성해보자

In [3]:
df=pd.DataFrame(data)
df

     Company Employee  Sales
0     Google      Sam    200
1     Google  Charlie    120
2  Microsoft      Amy    340
3  Microsoft  Vanessa    124
4   Facebook     Carl    243
5   Facebook    Sarah    350

### q2 company 기준으로 groupby 해보자

In [10]:
grp_df = df.groupby('Company')
type(grp_df)

pandas.core.groupby.generic.DataFrameGroupBy

### q3 각 회사별 평균 매출을 계산

In [19]:
for name, group in grp_df:
    numeric_group = group.select_dtypes(include=[np.number])
    print(name , numeric_group.mean())

Facebook Sales    296.5
dtype: float64
Google Sales    160.0
dtype: float64
Microsoft Sales    232.0
dtype: float64

In [25]:
#각 그룹의 수치형 데이터 평균을 저장할 빈 df 생성
group_means = pd.DataFrame()

for name, group in grp_df:
    numeric_group = group.select_dtypes(include=[np.number]).mean()
    
    #데이터프레임으로 변환하고, 열 이름 설정
    mean_df = pd.DataFrame(numeric_group).transpose()
    mean_df['Company'] = name
    
    #결과 데이터프레임에 추가
    group_means = pd.concat([group_means,mean_df],ignore_index = True)
    
group_means.set_index('Company',inplace=True)
group_means

           Sales
Company
Facebook   296.5
Google     160.0
Microsoft  232.0

### q4 각회사별 최대 매출을 계산

In [6]:
grp_df.max()

          Employee  Sales
Company
Facebook     Sarah    350
Google         Sam    200
Microsoft  Vanessa    340

### q5 각 회사별 직원 수를 계산

In [7]:
grp_df.count()

           Employee  Sales
Company
Facebook          2      2
Google            2      2
Microsoft         2      2

In [43]:
res =df.groupby(["Company","Employee"])
res

In [51]:
for name , group in res:
    print(f'{name} : {group}')

('Facebook', 'Carl') :     Company Employee  Sales
4  Facebook     Carl    243
('Facebook', 'Sarah') :     Company Employee  Sales
5  Facebook    Sarah    350
('Google', 'Charlie') :   Company Employee  Sales
1  Google  Charlie    120
('Google', 'Sam') :   Company Employee  Sales
0  Google      Sam    200
('Microsoft', 'Amy') :      Company Employee  Sales
2  Microsoft      Amy    340
('Microsoft', 'Vanessa') :      Company Employee  Sales
3  Microsoft  Vanessa    124

In [53]:
to_df = []

for name , group in res:
    to_df

                      0                                                  1  \
0      (Facebook, Carl)      Company Employee  Sales
4  Facebook     Ca...
1     (Facebook, Sarah)      Company Employee  Sales
5  Facebook    Sar...
2     (Google, Charlie)    Company Employee  Sales
1  Google  Charlie  ...
3         (Google, Sam)    Company Employee  Sales
0  Google      Sam  ...
4      (Microsoft, Amy)       Company Employee  Sales
2  Microsoft     ...
5  (Microsoft, Vanessa)       Company Employee  Sales
3  Microsoft  Van...

    Company Employee
0  Facebook     Carl
1  Facebook     Carl
2  Facebook     Carl
3  Facebook     Carl
4  Facebook     Carl
5  Facebook     Carl
                      0                                                  1  \
0      (Facebook, Carl)      Company Employee  Sales
4  Facebook     Ca...
1     (Facebook, Sarah)      Company Employee  Sales
5  Facebook    Sar...
2     (Google, Charlie)    Company Employee  Sales
1  Google  Charlie  ...
3         (Google, Sam)    Company Employee  Sales
0  Google      Sam  ...
4      (Microsoft, Amy)       Company Employee  Sales
2  Microsoft     ...
5  (Microsoft, Vanessa)       Company Employee  Sales
3  Microsoft  Van...

    Company Employee
0  Facebook    Sarah
1  Facebook    Sarah
2  Facebook    Sarah
3  Facebook    Sarah
4  Facebook    Sarah
5  Facebook    Sarah
                      0                                                  1  \
0      (Facebook, Carl)      Company Employee  Sales
4  Facebook     Ca...
1     (Facebook, Sarah)      Company Employee  Sales
5  Facebook    Sar...
2     (Google, Charlie)    Company Employee  Sales
1  Google  Charlie  ...
3         (Google, Sam)    Company Employee  Sales
0  Google      Sam  ...
4      (Microsoft, Amy)       Company Employee  Sales
2  Microsoft     ...
5  (Microsoft, Vanessa)       Company Employee  Sales
3  Microsoft  Van...

  Company Employee
0  Google  Charlie
1  Google  Charlie
2  Google  Charlie
3  Google  Charlie
4  Google  Charlie
5  Google  Charlie
                      0                                                  1  \
0      (Facebook, Carl)      Company Employee  Sales
4  Facebook     Ca...
1     (Facebook, Sarah)      Company Employee  Sales
5  Facebook    Sar...
2     (Google, Charlie)    Company Employee  Sales
1  Google  Charlie  ...
3         (Google, Sam)    Company Employee  Sales
0  Google      Sam  ...
4      (Microsoft, Amy)       Company Employee  Sales
2  Microsoft     ...
5  (Microsoft, Vanessa)       Company Employee  Sales
3  Microsoft  Van...

  Company Employee
0  Google      Sam
1  Google      Sam
2  Google      Sam
3  Google      Sam
4  Google      Sam
5  Google      Sam
                      0                                                  1  \
0      (Facebook, Carl)      Company Employee  Sales
4  Facebook     Ca...
1     (Facebook, Sarah)      Company Employee  Sales
5  Facebook    Sar...
2     (Google, Charlie)    Company Employee  Sales
1  Google  Charlie  ...
3         (Google, Sam)    Company Employee  Sales
0  Google      Sam  ...
4      (Microsoft, Amy)       Company Employee  Sales
2  Microsoft     ...
5  (Microsoft, Vanessa)       Company Employee  Sales
3  Microsoft  Van...

     Company Employee
0  Microsoft      Amy
1  Microsoft      Amy
2  Microsoft      Amy
3  Microsoft      Amy
4  Microsoft      Amy
5  Microsoft      Amy
                      0                                                  1  \
0      (Facebook, Carl)      Company Employee  Sales
4  Facebook     Ca...
1     (Facebook, Sarah)      Company Employee  Sales
5  Facebook    Sar...
2     (Google, Charlie)    Company Employee  Sales
1  Google  Charlie  ...
3         (Google, Sam)    Company Employee  Sales
0  Google      Sam  ...
4      (Microsoft, Amy)       Company Employee  Sales
2  Microsoft     ...
5  (Microsoft, Vanessa)       Company Employee  Sales
3  Microsoft  Van...

     Company Employee
0  Microsoft  Vanessa
1  Microsoft  Vanessa
2  Microsoft  Vanessa
3  Microsoft  Vanessa
4  Microsoft  Vanessa
5  Microsoft  Vanessa